ElemTypeInfo.m_symbolId
primary symbol id for all elements of this type

ElemTypeInfo.updateElementProperties(ControlledConstDocAccess!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,HeldElement!System.Runtime.CompilerServices.IsConst*)
Takes in a HeldElement and updates the properties and/or PrimarySymbol of the element
associated with it according to this ElemTypeInfo's data